{"keras_version": "2.1.5", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 256, 256, 1], "name": "input_3"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_3"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "filters": 64, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_204"}, "class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv2d_204"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 128, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_205"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_204", 0, 0, {}]]], "name": "conv2d_205"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "filters": 128, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_206"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_205", 0, 0, {}]]], "name": "conv2d_206"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 256, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_207"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_206", 0, 0, {}]]], "name": "conv2d_207"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "filters": 256, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_208"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_207", 0, 0, {}]]], "name": "conv2d_208"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 512, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_209"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_208", 0, 0, {}]]], "name": "conv2d_209"}, {"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 1000], "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 512, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_210"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_209", 0, 0, {}]]], "name": "conv2d_210"}, {"config": {"trainable": true, "name": "repeat_vector_1", "n": 1024}, "class_name": "RepeatVector", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "repeat_vector_1"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 256, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_211"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]], "name": "conv2d_211"}, {"config": {"target_shape": [32, 32, 1000], "trainable": true, "name": "reshape_1"}, "class_name": "Reshape", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "name": "reshape_1"}, {"config": {"axis": 3, "trainable": true, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["conv2d_211", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "name": "concatenate_1"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 256, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_212"}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "conv2d_212"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 128, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_213"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]], "name": "conv2d_213"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 64, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_214"}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_214"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 32, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_215"}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_215"}, {"config": {"activation": "relu", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 16, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_216"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]], "name": "conv2d_216"}, {"config": {"activation": "tanh", "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "filters": 2, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "name": "conv2d_217"}, "class_name": "Conv2D", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]], "name": "conv2d_217"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]], "name": "up_sampling2d_3"}], "name": "model_1", "output_layers": [["up_sampling2d_3", 0, 0]], "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}